<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_1/l1_intro.jpeg?raw=true"> </center>

<h2 class = "red"> Lecture 5 </h2>
<h3 class = "blue"> Pandas III</h3>
#### Nenad Svrzikapa
#### Harvard University
#### Python for Data Science
#### CSCI E-29

<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_1/2018_e29_staff.jpeg?raw=true"> </center>

## Quiz 2
<p class="grey"> 25 minutes </p>
<hr class="red">
* 15 questions
* Please close all browser tabs and windows and interpreter
* Quizzes are closed book/notes/interpreter/no internet help
* Check your answers at home
* You are free to leave when you complete the quiz

## PSET 1 
<p class="grey"> Solutions, Grades and Excellent Work! </p>
<hr class="red">
* Your work is graded
* Lena will hold a section going over pset 1 this Saturday
* Phil will hold a section going over pset 2 next Saturday
* We are not going to post a notebook of the solutions on github or canvas
* Volunteers

#### Lecture 5 Imports

In [1]:
import plotly
plotly.offline.init_notebook_mode(connected=True)
import plotly.graph_objs as go
import numpy as np
import pandas as pd

<center><h1 class = "blue"> DataFrame Concatenation</h1></center>

In [2]:
df1 = pd.DataFrame({'name':['Ann','Bob','Tijana'], 'color':['Blue','Red',np.nan]})
df2 = pd.DataFrame({'name':['Jane','Dana','Tihomir'], 'color':['Blue','Green','Green']}, index = [3,2,1])
df3 = pd.DataFrame({'name':['Sanja','Snezana','Petar'], 'color':['Blue','Green','Green']})

print (df1)
print (df2)
print (df3)

  color    name
0  Blue     Ann
1   Red     Bob
2   NaN  Tijana
   color     name
3   Blue     Jane
2  Green     Dana
1  Green  Tihomir
   color     name
0   Blue    Sanja
1  Green  Snezana
2  Green    Petar

#### This works but remember concat may result in duplicate index values

In [3]:
df4 = pd.concat([df1,df2,df3])
df4

   color     name
0   Blue      Ann
1    Red      Bob
2    NaN   Tijana
3   Blue     Jane
2  Green     Dana
1  Green  Tihomir
0   Blue    Sanja
1  Green  Snezana
2  Green    Petar

#### Reset a df index

In [4]:
df4 = df4.reset_index(drop=True)
df4

   color     name
0   Blue      Ann
1    Red      Bob
2    NaN   Tijana
3   Blue     Jane
4  Green     Dana
5  Green  Tihomir
6   Blue    Sanja
7  Green  Snezana
8  Green    Petar

<center><h1 class = "blue"> Handling Exceptions</h1></center>

#### Exception Handling is Anticipation

In [5]:
df5 = pd.concat([df1,df2], verify_integrity = True)

ValueError: Indexes have overlapping values: [1, 2]

In [ ]:
try:
    df5 = pd.concat([df1,df2], verify_integrity = True)
except ValueError as e:
    print ("Looks like we caught a ValueError")
    print (e)

### When to use try / except?

* Loading files
* Connecting to servers
* Communicating with databases
* Handling user input

In [ ]:
x = 5
try:
    result = 1 / x
except ZeroDivisionError as z:
    print(z)
else:
    print("Worked!")
    print (result)
finally:
    print ("I will execute no matter what")

<center><h1 class = "blue"> Merging DataFrames</h1></center>

In [ ]:
art_a = pd.read_csv('art_a.csv')
art_a

In [ ]:
art_b = pd.read_csv('art_b.csv')
art_b

In [ ]:
art_c = pd.read_csv('art_c.csv')
art_c

<center><h1 class = "blue"> What if we want to merge more than 2 DataFrames?</h1></center>

In [ ]:
#Merging DataFrames based on a column
try:
    a_b_c_merge = pd.merge(art_a, art_b,art_c, on='Artist Name')
except ValueError as e:
    print (e)
try:
    a_b_c_merge
except NameError as n:
    print (n)

<center><h1 class = "blue"> Nesting, Chaining, Reduce </h1></center>

In [ ]:
#option 1 Nesting
a_b_c_merge_nest = pd.merge(pd.merge(art_a,art_b,on='Artist Name'),art_c,on='Artist Name')
#option 2 Chaining
a_b_c_merge_chain = art_a.merge(art_b,on='Artist Name').merge(art_c,on='Artist Name')
#option 3 nice, clean, scalable
from functools import reduce
my_dfs = [art_a,art_b,art_c]
a_b_c_merge_reduced = reduce(lambda x,y: pd.merge(x,y, on = "Artist Name"),my_dfs)

<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_6/images/reduce.jpeg?raw=true"> </center>

In [ ]:
a_b_c_merge_nest.equals(a_b_c_merge_chain) == a_b_c_merge_chain.equals(a_b_c_merge_reduced)

In [211]:
art_a = pd.read_csv('art_a.csv')
art_a

   id       Artist Name  Category  Exhibits
0   1  Marina Abramovic         1        56
1   2      Chris Burden         1        60
2   3         Ai Weiwei         2        45
3   4      Joseph Beuys         2        46
4   5      Azuma Makoto         4        54

In [212]:
art_b = pd.read_csv('art_b.csv')
art_b

        Artist Name  Score  Exhibits
0  Marina Abramovic     95        59
1      Chris Burden     80        65
2         Ai Weiwei     93        55

In [213]:
df_a_b = pd.merge(art_a,art_b)
df_a_b

Empty DataFrame
Columns: [id, Artist Name, Category, Exhibits, Score]
Index: []

#### Guess why this merge "didn't work"?

In [ ]:
art_c = pd.read_csv('art_c.csv')
art_c

In [ ]:
df_a_c = pd.merge(art_a,art_c)
df_a_c

In [ ]:
art_e = pd.read_csv('art_e.csv')
art_e

#### It worked but there was no intersection in both columns in the same row

In [ ]:
df_a_e = pd.merge(art_a,art_e)
df_a_e

#### Default behavior of the .merge method is INNER Join

In [ ]:
df_a_e = pd.merge(art_a,art_e, how="inner")
df_a_e

<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_6/images/inner_join.jpeg?raw=true"> </center>

<center><h1 class = "blue"> On the .join and .merge DataFrame methods </h1></center>

### The .join method is intended for index-based joins.  Most of the time you will find yourself joining DataFrames on columns and for that you will need to use the .merge method

#### .merge for joining on Columns
#### else, if you want to get the same behaviour from the .join method you will have to set the columns as indexes first

In [ ]:
df1 = art_a.copy()
df2 = art_e.copy()
df3 = df1.join(df2)

In [ ]:
df1

In [ ]:
df2

<center><h3 class = "blue"> The .join method will attempt to join the DataFrames but in the event that you have duplicate column names you will need to either drop overlaps, rename one side or rename both sides  </h3></center>

#### Options? 

* Delete the columns if you don't need it
* Rename matching columns on one side
* Rename matching columns on both sides

In [ ]:
#Here I am adding a suffix to all matching columns coming from the left(df1) and the ones on the right (df2)
df3 = df1.join(df2, lsuffix='_left', rsuffix='_right')

#### Default behavior of .join is OUTER Join

In [ ]:
df3

#### We can replicate this behavior with the .merge method

In [ ]:
df1_df2 = pd.merge(art_a,art_e, how='outer', left_index = True,right_index = True)
df1_df2

In [ ]:
#Remember to reproduce the join behavior we need to merge on index
df1_df2 = pd.merge(art_a,art_e, how='outer', left_index = True,right_index = True)
df1_df2

<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_6/images/outer_join.jpeg?raw=true"> </center>

<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_6/images/left_join.jpeg?raw=true"> </center>

#### LEFT JOIN:
#### use the how = 'left' parameter
#### Keeps only the values from the overlapping columns from the DataFrame that we call the .merge method on

In [ ]:
#We keep everything from the left df and the intersection
df1_df2_left = pd.merge(art_a,art_e, how='left', on= "Artist Name")
df1_df2_left

<center><img style="align: center;"  src="https://github.com/sunworshipper/e29/blob/master/Lecture_6/images/right_join.jpeg?raw=true"> </center>

#### RIGHT JOIN:
#### use the how = 'right' parameter
#### Keeps only the values from the overlapping columns from the DataFrame that is second in pd.merge() or passed as first in a df.merge() syntax approach

In [ ]:
#We keep everything from the right df and the intersection
df1_df2_right = art_a.merge(art_e, how='right', on= "Artist Name")
#The outcome of these lines is the same this is just a different syntax to achieve the same thing
df1_df2_right = pd.merge(art_a,art_e, how='right', on= "Artist Name")
print (art_a)
print (art_e)
df1_df2_right

#### What if we don't provide the on parameter?

In [ ]:
df1_df2_no_on = art_a.merge(art_e, how='right')
print (art_a)
print (art_e)
df1_df2_no_on

### Merge two dataframes on specific columns where those columns have different column names

In [ ]:
art_a

In [ ]:
art_e.columns = ['Artist Name_y', 'Score_y','Exhibits_y']
art_e

In [ ]:
try:
    art_a.merge(art_e, on = "Artist Name")
except KeyError as k:
    print ("Couldn't find key",k,"in df.")

In [ ]:
merged = art_a.merge(art_e, left_on = "Artist Name", right_on = "Artist Name_y")
merged

### Merge two dataframes on specific multiple columns where those columns have different column names

In [ ]:
merged_multi = art_a.merge(art_e, left_on = ["Artist Name","Exhibits"], right_on = ["Artist Name_y","Exhibits_y"])
merged_multi

<center><h1 class = "blue"> Types of Joins </h1></center>

* ONE-TO-ONE joins: i.e. joining two DataFrame objects on their indexes where the indexes must contain unique values
* many-to-one joins: i.e. joining an unique index to one or more DataFrame columns
* many-to-many joins: joining columns on columns

<center><h3 class = "green"> ONE-TO-ONE Join Example </h3></center>

In [128]:
name_desc = pd.DataFrame({'names':['Alan','Jay','Sam','Hannah'],
                   'description':['Bioinformatics','Biology','Bioinformatics','Biology']})
name_salary = pd.DataFrame({'names':['Jay','Alan','Sam','Hannah'],
                   'salary':[120000,105000,130000,100000]})

df3 = pd.merge(name_desc,name_salary)
df3

      description   names  salary
0  Bioinformatics    Alan  105000
1         Biology     Jay  120000
2  Bioinformatics     Sam  130000
3         Biology  Hannah  100000

<center><h3 class = "green"> MANY-TO-ONE Join Example </h3></center>

In [129]:
desc_leader = pd.DataFrame({'manager':['Clara','Sanja'],
                           'description':['Bioinformatics','Biology']})

many_to_one = pd.merge(df3,desc_leader)
many_to_one

      description   names  salary manager
0  Bioinformatics    Alan  105000   Clara
1  Bioinformatics     Sam  130000   Clara
2         Biology     Jay  120000   Sanja
3         Biology  Hannah  100000   Sanja

<center><h3 class = "green"> MANY-TO-MANY Join Example </h3></center>

In [130]:
skill_desc = pd.DataFrame({'skills':['computational','alorithms','in vitro','in vivo'],
                           'description':['Bioinformatics','Bioinformatics','Biology','Biology']})

many_to_many = pd.merge(many_to_one, skill_desc)
many_to_many

      description   names  salary manager         skills
0  Bioinformatics    Alan  105000   Clara  computational
1  Bioinformatics    Alan  105000   Clara      alorithms
2  Bioinformatics     Sam  130000   Clara  computational
3  Bioinformatics     Sam  130000   Clara      alorithms
4         Biology     Jay  120000   Sanja       in vitro
5         Biology     Jay  120000   Sanja        in vivo
6         Biology  Hannah  100000   Sanja       in vitro
7         Biology  Hannah  100000   Sanja        in vivo

<center><h1 class = "blue"> Pivot Tables </h1></center>
##### Some of the pivot tables code examples were adopted from JVP (Python Data Science Handbook)

In [79]:
titanic = pd.read_csv('titanic.csv')
print (titanic.columns)
titanic.head()

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

<center><h1 class = "blue"> A little bit of Harvard History </h1></center>
<a href "https://news.harvard.edu/gazette/story/2012/04/as-result-of-titanics-sinking-widener-library-rose/"> More here </a>

In [98]:
titanic[titanic['name'].str.contains("Widener").fillna(False)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
312,1.0,0.0,"Widener, Mr. George Dunton",male,50.0,1.0,1.0,113503,211.5,C80,C,NaN,NaN,"Elkins Park, PA"
313,1.0,0.0,"Widener, Mr. Harry Elkins",male,27.0,0.0,2.0,113503,211.5,C82,C,NaN,NaN,"Elkins Park, PA"
314,1.0,1.0,"Widener, Mrs. George Dunton (Eleanor Elkins)",female,50.0,1.0,1.0,113503,211.5,C80,C,4,NaN,"Elkins Park, PA"

In [101]:
titanic[titanic['name'].str.contains("Norris").fillna(False)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
317,1.0,1.0,"Williams, Mr. Richard Norris II",male,21.0,0.0,1.0,PC 17597,61.3792,NaN,C,A,NaN,"Geneva, Switzerland / Radnor, PA"

In [102]:
titanic[titanic['name'].str.contains("Astor").fillna(False)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
10,1.0,0.0,"Astor, Col. John Jacob",male,47.0,1.0,0.0,PC 17757,227.525,C62 C64,C,NaN,124.0,"New York, NY"
11,1.0,1.0,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0,1.0,0.0,PC 17757,227.525,C62 C64,C,4,NaN,"New York, NY"

In [104]:
titanic[titanic['name'].str.contains("Millet").fillna(False)]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
205,1.0,0.0,"Millet, Mr. Francis Davis",male,65.0,0.0,0.0,13509,26.55,E38,S,NaN,249.0,"East Bridgewater, MA"

<center><h3 class = "green"> Survival rate by gender </h3></center>

In [22]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.727468
male      0.190985
Name: survived, dtype: float64

In [107]:
titanic.groupby(['sex','pclass'])['survived'].aggregate('mean').unstack()

pclass       1.0       2.0       3.0
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

<center><h1 class = "blue"> Stacking, Unstacking and Multi-level Indexing </h1></center>

### UNSTACKING

Take the inner most level of a multi-level index and make it the inner most level for the columns

### STACKING

Take the inner most level of the columns and make it the inner most level of a multi-level index

In [105]:
#Multi-level index for hierarchy
df = pd.DataFrame(np.random.randn(4, 4), index=pd.MultiIndex(levels=[['spam', 'tesla'], ['one', 'two']],
           labels=[[0, 0, 1, 1], [0, 1,0,1]],
           names=['first', 'second']), columns=['A', 'B','C','D'])
df
df.stack()

first  second
spam   one     A    0.391911
               B    0.405556
               C   -1.868618
               D    0.390912
       two     A   -1.275365
               B   -0.644727
               C    1.740493
               D   -0.686349
tesla  one     A   -0.283902
               B    1.032233
               C    0.418950
               D    1.420419
       two     A    0.266131
               B   -1.985782
               C   -0.015598
               D   -2.074814
dtype: float64

### Accessing a multi-level index

In [74]:
print (df)
df.loc['spam']
df.loc['tesla','one']

A   -0.252579
B   -0.451379
C   -0.704303
D    0.182832
Name: (tesla, one), dtype: float64

### Back to Group By vs. Pivot Table

In [108]:
titanic.groupby(['sex','pclass'])['survived'].aggregate('mean').unstack()

pclass       1.0       2.0       3.0
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

In [112]:
titanic.pivot_table(values = 'survived', index = 'sex', columns = 'pclass')

pclass       1.0       2.0       3.0
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

### How pivot tables work

In [121]:
#Multi-level index for hierarchy
df = pd.DataFrame(np.random.randn(4, 4), index=pd.MultiIndex(levels=[['spam', 'tesla'], ['one', 'two']],
           labels=[[0, 0, 1, 1], [0, 1,0,1]],
           names=['first', 'second']), columns=['A', 'B','C','D'])
df['E'] = ['alpha','beta','alpha','beta']
df['Values'] = [1,2,3,4]
df

                     A         B         C         D      E  Values
first second
spam  one    -1.921444  0.804655 -0.390046 -1.636347  alpha       1
      two    -1.168314 -1.156972 -0.742545 -2.267734   beta       2
tesla one     1.428737  1.469456 -0.562550  0.444205  alpha       3
      two    -1.205343  1.220039  0.297754 -0.013610   beta       4

In [124]:
#what will happen if I try to stack this
#start reading from columns that's the easiest, then values column, then index
df.pivot_table(values = 'Values', index = ['first','second'],columns = ['E'])

E             alpha  beta
first second
spam  one       1.0   NaN
      two       NaN   2.0
tesla one       3.0   NaN
      two       NaN   4.0

### Multilevel pivot tables

In [161]:
#More about binning continuous variables in Pandas here
#http://benalexkeen.com/bucketing-continuous-variables-in-pandas/
age_binned = pd.cut(titanic['age'],[0,20,40,60,80])
print (type(age))
titanic.pivot_table('survived',['sex',age_binned], 'pclass')

<class 'pandas.core.series.Series'>

pclass                        1.0       2.0       3.0
sex    age
female (0.0869, 40.083]  0.963855  0.908046  0.485714
       (40.083, 80.0]    0.960000  0.812500  0.333333
male   (0.0869, 40.083]  0.444444  0.169355  0.182109
       (40.083, 80.0]    0.265823  0.058824  0.055556

### More pivot_table examples

In [164]:
print (many_to_many)
#alternative syntax
pd.pivot_table(many_to_many,index=["manager",'names'])
many_to_many.pivot_table(values = 'salary',index=["manager",'names'])

      description   names  salary manager         skills
0  Bioinformatics    Alan  105000   Clara  computational
1  Bioinformatics    Alan  105000   Clara      alorithms
2  Bioinformatics     Sam  130000   Clara  computational
3  Bioinformatics     Sam  130000   Clara      alorithms
4         Biology     Jay  120000   Sanja       in vitro
5         Biology     Jay  120000   Sanja        in vivo
6         Biology  Hannah  100000   Sanja       in vitro
7         Biology  Hannah  100000   Sanja        in vivo

                salary
manager names
Clara   Alan    105000
        Sam     130000
Sanja   Hannah  100000
        Jay     120000

In [138]:
df_piv = pd.read_csv('piv.csv')
df_piv

,Account,Employee,Manager,Product,Revenue,Status,Expenses
0,Fidelity,Ann,Rick,Advertising 1,NaN,In Negotiation,0
1,Fidelity,Maria,Rick,Advertising 1,10000.0,Completed,400
2,Fidelity,Saul,Morty,Advertising 1,5000.0,Completed,800
3,Fidelity,Sam,Morty,Advertising 2,100000.0,Completed,750
4,Fidelity,Kyle,Morty,Advertising 2,20000.0,Completed,1000
5,Bank Of America,Kyle,Morty,Advertising 2,NaN,In Negotiation,1450
6,Bank Of America,Kyle,Morty,Advertising 3,20000.0,Completed,1560
7,Citizen,Sam,Morty,Advertising 3,20000.0,Completed,300
8,Citizen,Maria,Rick,Advertising 3,NaN,In Negotiation,400
9,Vanguard,Maria,Rick,Advertising 3,25000.0,Completed,500
10,Vanguard,Tijana,Rick,Advertising 3,25000.0,Completed,400

In [165]:
df_piv.pivot_table(index=["Manager",'Employee'])

                     Expenses  Revenue
Manager Employee
Morty   Kyle      1336.666667  20000.0
        Sam        525.000000  60000.0
        Saul       800.000000   5000.0
Rick    Ann          0.000000      NaN
        Maria      433.333333  17500.0
        Tijana     400.000000  25000.0

In [167]:
df_piv.pivot_table(index=["Status",'Manager'])

                           Expenses  Revenue
Status         Manager
Completed      Morty     882.000000  33000.0
               Rick      433.333333  20000.0
In Negotiation Morty    1450.000000      NaN
               Rick      200.000000      NaN

In [168]:
df_piv.pivot_table(index=["Product"])

                  Expenses  Revenue
Product
Advertising 1   400.000000   7500.0
Advertising 2  1066.666667  60000.0
Advertising 3   632.000000  22500.0

#### Selecting only specific columns

In [144]:
#Average expensed by employee
df_piv.pivot_table(values=["Expenses"],index=["Manager","Employee"], columns = 'Product')

                      Expenses
Product          Advertising 1 Advertising 2 Advertising 3
Manager Employee
Morty   Kyle               NaN        1225.0        1560.0
        Sam                NaN         750.0         300.0
        Saul             800.0           NaN           NaN
Rick    Ann                0.0           NaN           NaN
        Maria            400.0           NaN         450.0
        Tijana             NaN           NaN         400.0

#### Changing the aggregation function (default is mean)

In [146]:
#How much money did employees expense
df_piv.pivot_table(index=["Manager","Employee"],values=["Expenses"],aggfunc=np.sum)

                  Expenses
Manager Employee
Morty   Kyle          4010
        Sam           1050
        Saul           800
Rick    Ann              0
        Maria         1300
        Tijana         400

#### Explicit is better than implicit but this works

In [147]:
df_piv.pivot_table("Expenses",["Manager","Employee"],aggfunc=np.sum)

                  Expenses
Manager Employee
Morty   Kyle          4010
        Sam           1050
        Saul           800
Rick    Ann              0
        Maria         1300
        Tijana         400

#### You don't need to specify the values explicitly if you specify them in the aggfunc

In [171]:
#A dictionary mapping can be provided for the aggregation function
df_piv.pivot_table(index = ["Manager","Employee"],aggfunc={'Expenses':'sum', 'Revenue':'mean'})

                  Expenses  Revenue
Manager Employee
Morty   Kyle          4010  20000.0
        Sam           1050  60000.0
        Saul           800   5000.0
Rick    Ann              0      NaN
        Maria         1300  17500.0
        Tijana         400  25000.0

#### If you do specify the values you can pass a list instead of a dictionary to the aggfunc

In [181]:
#Here since values were explicitly declared we pass what the aggregation methods in a list
df_piv.pivot_table(values = ['Expenses','Revenue'],index = ["Manager","Employee"],aggfunc=[sum,np.mean])

                      sum                   mean
                 Expenses   Revenue     Expenses  Revenue
Manager Employee
Morty   Kyle         4010   40000.0  1336.666667  20000.0
        Sam          1050  120000.0   525.000000  60000.0
        Saul          800    5000.0   800.000000   5000.0
Rick    Ann             0       0.0     0.000000      NaN
        Maria        1300   35000.0   433.333333  17500.0
        Tijana        400   25000.0   400.000000  25000.0

#### Finally we have another parameter called margins which adds a summary row

In [184]:
#Here since values were explicitly declared we pass what the aggregation methods in a list
df_piv.pivot_table(values = ['Expenses'],index = ["Manager","Employee"],aggfunc=[np.sum], margins = True)

                      sum
                 Expenses
Manager Employee
Morty   Kyle         4010
        Sam          1050
        Saul          800
Rick    Ann             0
        Maria        1300
        Tijana        400
All                  7560

<center><h1 class = "blue"> Data Melting </h1></center>

#### Going from Wide to Long

In [185]:
scores = pd.DataFrame({"name":["Adam","Jane","Hannah"],
                      "quiz1":[14,12,13],
                      "quiz2":[10,11,13],
                      "tf":['Joe','Alan','Alan']})
scores

     name  quiz1  quiz2    tf
0    Adam     14     10   Joe
1    Jane     12     11  Alan
2  Hannah     13     13  Alan

In [206]:
long = pd.melt(scores, id_vars = ['name','tf'], value_vars = ['quiz1','quiz2'], var_name = 'quizzes', value_name = 'score')
long

     name    tf quizzes  score
0    Adam   Joe   quiz1     14
1    Jane  Alan   quiz1     12
2  Hannah  Alan   quiz1     13
3    Adam   Joe   quiz2     10
4    Jane  Alan   quiz2     11
5  Hannah  Alan   quiz2     13

#### Going from Long to Wide is Harder :)

In [207]:
wide = long.pivot_table(index = ['name','tf'], columns = ['quizzes'], values = ['score'])
wide

            score
quizzes     quiz1 quiz2
name   tf
Adam   Joe     14    10
Hannah Alan    13    13
Jane   Alan    12    11

In [208]:
wide = wide.reset_index()
wide

           name    tf score
quizzes               quiz1 quiz2
0          Adam   Joe    14    10
1        Hannah  Alan    13    13
2          Jane  Alan    12    11

In [210]:
columns = wide.columns
level_1 = columns.get_level_values(1)
level_0 = columns.get_level_values(0)
for i in zip(level_0,level_1):
    print (i)

('name', '')
('tf', '')
('score', 'quiz1')
('score', 'quiz2')

In [200]:
column_names = [x[1] if x[1] else x[0] for x in zip(level_0,level_1)]

wide.columns = column_names
wide

     name    tf  quiz1  quiz2
0    Adam   Joe     14     10
1  Hannah  Alan     13     13
2    Jane  Alan     12     11